{
  "nav_story": "The Story",
  "nav_map": "Tour Map",
  "nav_attractions": "Attractions",
  "nav_about": "About Us",
  "hero_title": "Tuku GO",
  "hero_subtitle": "Discover the Hidden Charms and Stories of Tuku, Yunlin",
  "hero_button": "Begin the Journey",
  "story_title": "The Story of Tuku",
  "story_content": "Tuku is more than just a place on a map. It's a town woven from threads of history, culture, and the unforgettable aroma of sesame oil. From bustling markets to serene temples, every corner holds a story. Tuku GO is your personal guide to unlocking these treasures. We invite you to wander, to taste, and to discover the living history of this remarkable town.",
  "map_title": "Interactive Tour Map",
  "attractions_title": "Featured Attractions",
  "spot_story_title": "Spot Story",
  "panorama_title": "360 Panorama",
  "card_button": "Learn More",
  "map_button_text": "View on Map",
  "filter_all": "All",
  "transportation_title": "Getting to Tuku",
  "transport_hsr_title": "By High-Speed Rail (HSR)",
  "transport_hsr_desc": "Take the HSR to 'Yunlin Station'. From there, a taxi or rental car can get you to the center of Tuku in about 20-25 minutes.",
  "transport_tra_title": "By Train (TRA)",
  "transport_tra_desc": "Take the TRA to 'Dounan Station' or 'Douliu Station'. From there, you can take a Taisi Bus or a taxi to Tuku, which takes about 20-30 minutes.",
  "transport_car_title": "By Car",
  "transport_car_desc": "Via National Freeway No. 1, take the 'Huwei Interchange' or 'Dounan Interchange'. Follow the signs for about 15-20 minutes to reach Tuku. Parking is available in the town.",
  "footer_text": "&copy; 2025 Tuku GO. All Rights Reserved. A professional website designed for Tuku.",
  "detail_meta_address": "Address",
  "detail_meta_hours": "Hours",
  "detail_gallery_title": "Photo Gallery",
  "detail_nearby_title": "Nearby Attractions",
  "detail_nearby_button": "Explore ({distance} km away)",
  "error_missing_id": "Attraction ID is missing.",
  "error_db_load": "Could not load attraction database.",
  "error_not_found": "Attraction not found.",
  "error_back_button": "Back to Homepage",
  "about_hero_title": "About This Project",
  "about_designer_name": "Zhuo Yun-Ting",
  "about_designer_title": "Designer & Project Initiator",
  "about_philosophy_title": "Design Philosophy: Connecting Technology with Local Culture",
  "about_philosophy_p1": "Tuku GO was born from a love for my hometown and a simple belief: good design and technology can breathe new life into ancient stories. As a designer, I believe user experience is not just about a smooth interface, but an emotional connection. Through this website, I hope to present the rich cultural heritage, the warmth of the people, and the hidden gems of Tuku in a modern, accessible way for every traveler.",
  "about_philosophy_p2": "From the color palette and typography to every detail of the interactive map, my goal was to create a digital space that is not only functional but also radiates warmth. This is more than a travel guide; it's an invitation to the world to discover this remarkable town.",
  "about_vision_title": "Project Vision: A Living Guide to Tuku",
  "about_vision_p1": "This website is a continuously evolving project. My vision is for it to become a 'living guide' that grows with Tuku, constantly uncovering more untold stories and hidden spots through the power of community. In the future, we hope to add more features like interviews with local shop owners, an event calendar, and even a user feedback system, allowing every user to become a contributor to this project.",
  "about_contact_title": "Get in Touch",
  "about_contact_p1": "Do you have any thoughts or suggestions for this project? Or perhaps a favorite private spot in Tuku that you believe must be featured? Feel free to reach out!",
  "lang_zh_TW": "繁體中文",
  "lang_en": "English",
  "lang_ja": "日本語",
  "lang_ko": "한국어",
  "lang_button_text": "Language"
}